// 柱状图-就业行业 数据
export const jobData = {
	xAxis: [
		"旅游行业",
		"教育培训",
		"游戏行业",
		"医疗行业",
		"电商行业",
		"社交行业",
		"金融行业",
	],
	yAxis: {
		2022: [200, 300, 300, 900, 1500, 1200, 600],
		2023: [300, 400, 350, 800, 1800, 1400, 700],
	},
};

// 折线图-人员变化
export const personData = {
	peopleNum: [
		[24, 40, 101, 134, 90, 230, 210, 230, 120, 230, 210, 120],
		[40, 64, 191, 324, 290, 330, 310, 213, 180, 200, 180, 79],
	],
	month: [
		"1月",
		"2月",
		"3月",
		"4月",
		"5月",
		"6月",
		"7月",
		"8月",
		"9月",
		"10月",
		"11月",
		"12月",
	],
};

// 饼形图-年龄分布
export const ageData = {
	ageRound: ["20岁以下", "20-29岁", "30-39岁", "40-49岁", "50岁以上"],
	ageNum: [
		{ value: 2, name: "20岁以下" },
		{ value: 4, name: "20-29岁" },
		{ value: 4, name: "30-39岁" },
		{ value: 2, name: "40-49岁" },
		{ value: 1, name: "50岁以上" },
	],
};

// 柱状体-技能掌握
export const technicalData = {
	ratio: [0.5, 0.34, 0.60, 0.78, 0.69],
    ratioFull: [1, 1, 1, 1, 1],
	titlename: ["HTML5", "CSS3", "javascript", "VUE", "NODE"],
	questionNum: [702, 350, 610, 793, 664],
    color: ["#1089E7", "#F57474", "#56D0E3", "#F8B448", "#8B78F6"],
};

// 折线图-播放量



// 饼形图-地区分布
