export const recordC = [
	{
		time: "2024-11-25",
		desc: [
			"将项目打包工具webpack更换为rspack",
			"打包速度飞起，mac mini M4 启动从10秒到1.3秒，打包也仅仅两三秒，Windows启动从40秒到十秒，巨大的提升，一切优化在这个面前都不值一提"
		],
	},
	{
		time: "2024-11-23",
		desc: [
			"网站更新记录上线",
			"网站开发了这么久，终于上线了日志模块😂"
		],
	},
	{
		time: "2024-11-21",
		desc: [
			"首页背景图及相关的更换图片",
			"同时首页的背景图片上传CDN功能也和case模块相同，支持全量和增量上传背景图片"
		],
	},
	{
		time: "2024-11-20",
		desc: [
			"工具模块新增数据下标解析功能",
			"非通用型工具，只能解析特定的数据结构，提升个人工作是的开发效率"
		],
	},
	{
		time: "2024-5-6",
		desc: [
			"案例case模块上线",
		],
	},
	{
		time: "2024-4-15",
		desc: [
			"工具tool与游戏game模块上线",
		],
	},
	{
		time: "2024-4-12",
		desc: [
			"项目打包后自动上传到腾讯云",
			"gitpush后自动构建发布项目",
			"打包是变量透传区分路由使用history(git)和hash(CDN)",
		],
	},
	{
		time: "2024-4-12",
		desc: ["项目打包后自动上传到腾讯云", "gitpush后自动构建发布项目"],
	},
	{
		time: "2024-03-05",
		desc: ["文档项目初始化及MD文档读取功能"],
	},
];
